# HostId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheet..::..HostId Property
FabricSheet Class See Also
---
The structure element that contains the Fabric Sheet.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId HostId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HostId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ HostId {
	ElementId^ get ();
}
```

# See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace